code-review/NRB_3471_3546/База_Было/Documents/Выписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Выписка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СлужебноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.иц_СводноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МХВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МХУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияЦБ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеОтчетаВыписки</v8:Type>
						<v8:Type>cfg:DocumentRef.ГлобальнаяОперация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЦБВПути</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеНКД</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеквизитовСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеАнкетныхДанных</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацииЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБПолное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБЧастичное</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеРеестраВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПоручения</v8:Type>
						<v8:Type>cfg:DocumentRef.УчастиеВКД</v8:Type>
						<v8:Type>cfg:DocumentRef.КонвертацияЦБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭмитентВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭмитентУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтправкиОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыПередачиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияВыпискиОперационныйДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИнформация</Name>
					<Comment>Произвольный текст для вывода в соответствующее поля отчета о совершенной операции</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбновлятьДопИнформацию</Name>
					<Comment>Если требуется заблокировать автоматичсекое обновление поля, то следует установить этот флаг.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/CommonModules/ПодпискиНаСобытия/Ext/Module.bsl
// Обработчик события ПередЗаписью документов, 
// выписка по которым формируется автоматически.

Процедура ПриПроведенииДокументовФормированиеВыписки(Источник, Отказ, РежимПроведения) Экспорт
	Если (ТипЗнч(Источник) = Тип("ДокументОбъект.ОткрытиеРазделаСчетаДепо")
			Или ТипЗнч(Источник) = Тип("ДокументОбъект.ЗакрытиеРазделаСчетаДепо"))	
		И ЗначениеЗаполнено(Источник.СчетДепо)
		И ТипЗнч(Источник.СчетДепо) = Тип("СправочникСсылка.СчетаДепоМХ")
		И ЗначениеЗаполнено(Источник.СчетДепо.ВладелецСчетаДепоМХ)
		И ТипЗнч(Источник.СчетДепо.ВладелецСчетаДепоМХ) = Тип("СправочникСсылка.Организации") Тогда
		Возврат;	// Выписку формировать не нужно, т.к. выписка дается клиенту, а тут мы и есть клиент
	КонецЕсли;
	
	// Формируем выписку
	Если ЗначениеЗаполнено(Источник.Ссылка) Тогда
		ДокументВыписка = Документы.Выписка.НайтиПоРеквизиту("ОперацияЦБ", Источник.Ссылка);
	Иначе
		СсылкаНового = Документы[Источник.Метаданные().Имя].ПолучитьСсылку();
		Источник.УстановитьСсылкуНового(СсылкаНового);
		ДокументВыписка = Документы.Выписка.ПустаяСсылка();
	КонецЕсли;
	
	ОтключитьФормированиеВыписки =
		ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("83.ФормированиеСводныхОтчетовОСовершенныхОперациях", Ложь)
		И ТипЗнч(Источник) <> Тип("ДокументСсылка.ФормированиеОтчетаВыписки")
		И ТипЗнч(Источник) <> Тип("ДокументОбъект.ФормированиеОтчетаВыписки");
	Если ОтключитьФормированиеВыписки Тогда
		
		Документы.СводныйОтчетОСовершенныхОперациях.ИсполнитьПоручениеВыпиской(Источник);
		
	Иначе
		
		Если ДокументВыписка.Пустая() Тогда
			ДокументВыписка = Документы.Выписка.СоздатьДокумент();
		Иначе
			ДокументВыписка = ДокументВыписка.ПолучитьОбъект();
		КонецЕсли;
		ДокументВыписка.Заполнить(Источник);
		ДокументВыписка.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалениеВыписокПриПометкеНаУдалениеПриЗаписи(Источник, Отказ) Экспорт
	Если Источник.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Выписка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Выписка КАК Выписка
	|ГДЕ
	|	Выписка.ОперацияЦБ = &Ссылка
	|ИЛИ
	|	Выписка.ДокументОснование = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Удалить();
	КонецЦикла;
КонецПроцедуры

// Процедура выполняет проверку необходимости перенумерации документов типа источника за день
// в случае необходимости выполняется регистрация типа документа в регистре сведений "РегистрацияДокументовКПеренумерации"
Процедура ДокументыКПеренумерацииПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ДополнительныеСвойства.Свойство("ОнлайнЗагрузка") Или Источник.ДополнительныеСвойства.Свойство("Перенумерация") Тогда
		Возврат;  // отключение регистрации документов в режиме загрузки или перенумерации
	КонецЕсли;		
		
	ИмяИсточника = Источник.Метаданные().Имя;
	Менеджер = РегистрыСведений.РегистрацияДокументовКПеренумерации;
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(Источник.Ссылка) Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Менеджер.ЗарегистрироватьДокументыКПеренумерации(ИмяИсточника, Источник.Дата);
		КонецЕсли;
	ИначеЕсли  Источник.Ссылка.Проведен Или Источник.Проведен Тогда 
		Если Источник.Ссылка.Дата <> Источник.Дата Тогда 
			Менеджер.ЗарегистрироватьДокументыКПеренумерации(ИмяИсточника,Источник.Ссылка.Дата);
		КонецЕсли;	
		Менеджер.ЗарегистрироватьДокументыКПеренумерации(ИмяИсточника,Источник.Дата);
	КонецЕсли;	 
	
КонецПроцедуры	 

Процедура ПередЗаписьюДокументовДляОбмена(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура ПередУдалениемДокументовДляОбмена(Источник, Отказ) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением(Источник, Отказ);
КонецПроцедуры

Процедура ПередЗаписьюСправочниковДляОбменаПередЗаписью(Источник, Отказ) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью(Источник, Отказ);
КонецПроцедуры

Процедура ПередЗаписьюНабораДляОбменаПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра(Источник, Отказ, Истина);
	
КонецПроцедуры

Процедура ПередЗаписьюДокументовУстановитьАвтора(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ЭтоНовый() Тогда
		Источник.Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаКомментарияКИсторииДанных(Источник, Отказ) Экспорт
	Если Источник.ДополнительныеСвойства.Свойство("КомментарийДляИсторииДанных") Тогда
		Источник.УстановитьКомментарийВерсииИсторииДанных(Источник.ДополнительныеСвойства.КомментарийДляИсторииДанных);
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписиДокументовДляДобавленияВЖурналИсходящихСообщенийКафкаПриЗаписи(Источник, Отказ) Экспорт
	ОбменДаннымиКафка.ЗаписатьОбъектВИсходящиеСообщенияКафкаПриЗаписиДокумента(Источник);
КонецПроцедуры
